opensoap/samples/Hello/hello_request.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope 
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Body>
        <m:Hello xmlns:m="http://services.opensoap.jp/samples/Hello/">
            <MyName>foo</MyName>
        </m:Hello>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
